# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\Documents and Settings\dave\Desktop\fyp\SYSTEM\System_UART_ADC_DifferentialMode_16BIT.cydsn\System_UART_ADC_DifferentialMode_16BIT.cyprj
# Date: Thu, 08 Mar 2012 08:03:04 GMT
#set_units -time ns
create_clock -name {ClockBlock/clk_bus} -period 41.666666666666664 -waveform {0 20.8333333333333} [get_pins {ClockBlock/clk_bus}]
create_clock -name {ClockBlock/dclk_0} -period 375 -waveform {0 187.5} [get_pins {ClockBlock/dclk_0}]
create_clock -name {ClockBlock/aclk_0} -period 1583.3333333333333 -waveform {0 791.666666666667} [get_pins {ClockBlock/aclk_0}]
create_clock -name {ClockBlock/dclk_1} -period 2166.6666666666665 -waveform {0 1083.33333333333} [get_pins {ClockBlock/dclk_1}]
create_clock -name {CyIMO} -period 333.33333333333331 -waveform {0 166.666666666667} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyPLL_OUT} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/pllout}]]
create_clock -name {CyILO} -period 1000000 -waveform {0 500000} [list [get_pins {ClockBlock/ilo}] [get_pins {ClockBlock/clk_100k}] [get_pins {ClockBlock/clk_1k}] [get_pins {ClockBlock/clk_32k}]]
create_clock -name {CyMASTER_CLK} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/clk_sync}]]
create_generated_clock -name {adc_Ext_CP_Clk} -source [get_pins {ClockBlock/clk_sync}] -edges {1 9 19} [list [get_pins {ClockBlock/dclk_glb_0}]]
create_generated_clock -name {adc_theACLK} -source [get_pins {ClockBlock/clk_sync}] -divide_by 38 -duty_cycle 50 [list [get_pins {ClockBlock/aclk_glb_0}]]
create_generated_clock -name {uart_IntClock} -source [get_pins {ClockBlock/clk_sync}] -divide_by 52 -duty_cycle 50 [list [get_pins {ClockBlock/dclk_glb_1}]]
create_generated_clock -name {CyBUS_CLK} -source [get_pins {ClockBlock/clk_sync}] -duty_cycle 50 [list [get_pins {ClockBlock/clk_bus_glb}]]

set_false_path -from [get_pins {__ONE__/q}]

# Component constraints for C:\Documents and Settings\dave\Desktop\fyp\SYSTEM\System_UART_ADC_DifferentialMode_16BIT.cydsn\TopDesign\TopDesign.cysch
# Project: C:\Documents and Settings\dave\Desktop\fyp\SYSTEM\System_UART_ADC_DifferentialMode_16BIT.cydsn\System_UART_ADC_DifferentialMode_16BIT.cyprj
# Date: Thu, 08 Mar 2012 08:02:58 GMT
